tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "mczachurski/wallpapper"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Checks ansible playbooks for practices and behaviour
brew "ansible-lint"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 4.1+
brew "bash-completion@2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Reimplementation of ctags(1)
brew "ctags"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Emoji guide for your commit messages
brew "gitmoji"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Tool to move from `docker-compose` to Kubernetes
brew "kompose"
# Kubernetes command-line interface
brew "kubernetes-cli"
# The Kubernetes package manager
brew "kubernetes-helm"
# Unified display of technical and tag data for audio/video
brew "media-info"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# Port scanning utility for large networks
brew "nmap"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Powerful, clean, object-oriented scripting language
brew "ruby", link: true
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# 
brew "sshpass"
# Code-search similar to ack
brew "the_silver_searcher"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Bash completion for Vagrant
brew "vagrant-completion"
# Vi 'workalike' with many additional features
brew "vim"
# Executes a program periodically, showing output fullscreen
brew "watch"
brew "mczachurski/wallpapper/wallpapper"
cask "asciidocfx"
cask "atom"
cask "docker"
cask "dropbox"
cask "handbrake"
cask "hetimazipql"
cask "insomnia"
cask "iterm2"
cask "macvim"
cask "makemkv"
cask "miniconda"
cask "mkvtools"
cask "mp3tag"
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "quicklook-json"
cask "quicksilver"
cask "skitch"
cask "slack"
cask "sonic-visualiser"
cask "vagrant"
cask "vagrant-manager"
cask "virtualbox"
cask "wireshark"
cask "xld"
cask "yed"
