tap "beeftornado/rmtree"
tap "cloudfoundry/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "martido/brew-graph"
tap "mczachurski/wallpapper"
tap "sandreas/tap"
tap "starkandwayne/cf"
tap "universal-ctags/universal-ctags"
tap "watsonbox/cmu-sphinx"
# Interpreted, interactive, object-oriented programming language
brew "python"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Checks ansible playbooks for practices and behaviour
brew "ansible-lint"
# Text processor and publishing toolchain for AsciiDoc
brew "asciidoctor"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 4.1+
brew "bash-completion@2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Cross-platform make
brew "cmake"
# Tool for service discovery, monitoring and configuration
brew "consul"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Lint your Python code for style and logical errors
brew "flake8"
# Command-line fuzzy finder written in Go
brew "fzf"
# Extensions to follow Vincent Driessen's branching model
brew "git-flow"
# Emoji guide for your commit messages
brew "gitmoji"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GitHub Markdown previewer
brew "grip"
# Convert source code to formatted text with syntax highlighting
brew "highlight"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Interactive environments for writing and running code
brew "jupyter"
# Tool to move from `docker-compose` to Kubernetes
brew "kompose"
# Kubernetes command-line interface
brew "kubernetes-cli"
# The Kubernetes package manager
brew "kubernetes-helm"
# Library to render SVG files using Cairo
brew "librsvg"
# Unified display of technical and tag data for audio/video
brew "media-info"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# SOund eXchange: universal sound sample translator
brew "sox"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# 
brew "sshpass"
# Generate scripting interfaces to C/C++ code
brew "swig"
# Tool to build, change, and version infrastructure
brew "terraform"
# Code-search similar to ack
brew "the_silver_searcher"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# URL extractor/launcher
brew "urlview"
# Bash completion for Vagrant
brew "vagrant-completion"
# Vi 'workalike' with many additional features
brew "vim"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Linter for YAML files
brew "yamllint"
brew "cloudfoundry/tap/cf-cli"
brew "martido/brew-graph/brew-graph"
brew "mczachurski/wallpapper/wallpapper"
brew "starkandwayne/cf/om"
# Maintained ctags implementation
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
brew "watsonbox/cmu-sphinx/cmu-sphinxbase", args: ["HEAD"]
brew "watsonbox/cmu-sphinx/cmu-pocketsphinx", args: ["HEAD"]
brew "watsonbox/cmu-sphinx/cmu-sphinxtrain", args: ["HEAD"]
cask "asciidocfx"
cask "atom"
cask "basictex"
cask "docker"
cask "dropbox"
cask "font-hack-nerd-font"
cask "handbrake", { appdir: "~/Applications/Ops/Engineering/Transmutation/" }
cask "hetimazipql"
cask "insomnia"
cask "iterm2"
cask "krisp"
cask "makemkv"
cask "mkvtools"
cask "oni"
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "quicklook-json"
cask "quicksilver" { appdir: "~//Users/totally/Applications/Ops/Administration" }
cask "qutebrowser"
cask "skitch"
cask "slack", args: { appdir: "~/Applications/Comm/Instant" }
cask "sonic-visualiser"
cask "vagrant"
cask "vagrant-manager" { appdir: "~/Applications/Ops/Engineering" }:x
cask "virtualbox"
cask "wireshark" { appdir: "~//Users/totally/Applications/Astrometrics/Scanners }
cask "xld"
cask "yed", args: { appdir: "~/Applications/Comm/Visual" }
