tap "apple/apple"
tap "aquasecurity/trivy"
tap "aws/tap"
tap "buildpacks/tap"
tap "cloudfoundry/tap"
tap "danielfoehrkn/switch"
tap "defenseunicorns/tap"
tap "derailed/k9s"
tap "fabianishere/personal"
tap "federico-terzi/espanso"
tap "felixkratz/formulae"
tap "finnvoor/tools"
tap "fluxcd/tap"
tap "glasskube/tap"
tap "homebrew-ffmpeg/ffmpeg"
tap "homebrew/command-not-found"
tap "homebrew/test-bot"
tap "homeport/tap"
tap "jahvon/tap"
tap "joshmedeski/sesh"
tap "k14s/tap"
tap "knative/client"
tap "knqyf263/pet"
tap "martido/brew-graph"
tap "mczachurski/wallpapper"
tap "minio/stable"
tap "nativeos/i386-elf-toolchain"
tap "nikitabobko/tap"
tap "replicatedhq/replicated"
tap "saltbo/bin"
tap "siderolabs/tap"
tap "solo-io/tap"
tap "stewartlynch/tap"
tap "sttz/tap", "https://github.com/sttz/homebrew-tap.git"
tap "styrainc/packages"
tap "trknhr/tap"
tap "ubuntu/microk8s"
tap "universal-ctags/universal-ctags"
tap "watsonbox/cmu-sphinx"
tap "zdcthomas/tools"
# Any-to-PostScript filter
brew "a2ps"
# CLI for Amazon ECS to manage clusters and tasks for development
brew "amazon-ecs-cli"
# C library SSHv1/SSHv2 client and server protocols
brew "libssh"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Checks ansible playbooks for practices and behaviour
brew "ansible-lint"
# Strip or convert ANSI codes into HTML, (La)Tex, RTF, or BBCode
brew "ansifilter"
# Library and utilities for processing GIFs
brew "giflib"
# Color management engine supporting ICC profiles
brew "little-cms2"
# Image format providing lossless and lossy compression for web images
brew "webp"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# GitOps Continuous Delivery for Kubernetes
brew "argocd"
# Collection of portable C++ source libraries
brew "boost"
# Source-code syntax highlighter
brew "source-highlight"
# Formatter/translator for text files to numerous formats
brew "asciidoc"
# Text processor and publishing toolchain for AsciiDoc
brew "asciidoctor"
# Record and share terminal sessions
brew "asciinema"
# Perl compatible regular expressions library with a new API
brew "pcre2"
# Distributed revision control system
brew "git"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Use AWS IAM credentials to authenticate to Kubernetes
brew "aws-iam-authenticator"
# Securely manage AWS API credentials using AWS SSO
brew "aws-sso-cli"
# Smooth out the rough edges of AWS SSO (temporarily, until AWS makes it better)
brew "aws-sso-util"
# Securely store and access AWS credentials in development environments
brew "aws-vault"
# Official Amazon AWS command-line interface
brew "awscli"
# Azure Storage data transfer utility
brew "azcopy"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Programmable completion for Bash 4.2+
brew "bash-completion@2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# High performance key/value database
brew "berkeley-db", link: true
# Python code formatter
brew "black"
# Core application library for C
brew "glib"
# X.Org: Interface to the X Window System protocol
brew "libxcb"
# Vector graphics library with cross-device output support
brew "cairo"
# CD/DVD/Blu-ray premastering and recording software
brew "cdrtools"
# Tool to obtain certs from Let's Encrypt and autoenable HTTPS
brew "certbot"
# CLI to install, manage & troubleshoot Kubernetes clusters running Cilium
brew "cilium-cli"
# Cross-platform make
brew "cmake"
# Command-line tool to manage cert-manager
brew "cmctl"
# Linux virtual machines
brew "lima"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima", args: ["HEAD"]
# GNU File, Shell, and Text utilities
brew "coreutils"
# Tool for interacting with remote images and registries
brew "crane"
# Portable devkit for CI/CD pipelines
brew "dagger"
# JSON, YAML, TOML, XML, and CSV query and modification tool
brew "dasel"
# Tools to manipulate dates with a focus on financial data
brew "dateutils"
# Display user-friendly message boxes from shell scripts
brew "dialog"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Library access to GnuPG
brew "gpgme"
# Library for JPEG-2000 image manipulation
brew "openjpeg"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Visually compare two PDF files
brew "diff-pdf"
# Load/unload environment variables based on $PWD
brew "direnv"
# Bash, Zsh and Fish completion for Docker
brew "docker-completion"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Create Docker hosts locally and on cloud providers
brew "docker-machine"
# Text processing system for reStructuredText
brew "docutils"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# More intuitive version of du in rust
brew "dust"
# Simple command-line tool for creating clusters on Amazon EKS
brew "eksctl"
# Open-source framework for augmenting humans using AI
brew "fabric-ai"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line encoder frontend for libfdk-aac
brew "fdk-aac-encoder"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Collection of GNU find, xargs, and locate
brew "findutils"
# I/O benchmark and stress test
brew "fio"
# Lint your Python code for style and logical errors
brew "flake8"
# HTTP and gRPC load testing and visualization tool and server
brew "fortio"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Generic library support script
brew "libtool"
# Libraries to talk to Microsoft SQL Server and Sybase databases
brew "freetds"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# Library for encoding and decoding .avif files
brew "libavif"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# Platform built on V8 to build network applications
brew "node"
# Interact with Google Gemini AI models from the command-line
brew "gemini-cli"
# GitHub command-line tool
brew "gh"
# GIF image/animation creator/editor
brew "gifsicle"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Extensions to follow Vincent Driessen's branching model
brew "git-flow"
# Interactive command-line tool for using emoji in commit messages
brew "gitmoji"
# Open-source GitLab command-line tool
brew "glab"
# Envoy-Powered API Gateway
brew "glooctl"
# Command-line option parsing utility
brew "gnu-getopt"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Task is a task runner/build tool that aims to be simpler and easier to use
brew "go-task"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Deliver Go binaries as fast and easily as possible
brew "goreleaser"
# OpenType text shaping engine
brew "harfbuzz"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Library for manipulating JPEG-2000 images
brew "jasper"
# Image manipulation
brew "netpbm"
# GNU triangulated surface library
brew "gts"
# Framework for layout and rendering of i18n text
brew "pango"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GNU grep, egrep and fgrep
brew "grep"
# GitHub Markdown previewer
brew "grip"
# Make JSON greppable
brew "gron"
# Like cURL, but for gRPC
brew "grpcurl"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# Tool for glamorous shell scripts
brew "gum"
# Smarter Dockerfile linter to validate best practices
brew "hadolint"
# Kubernetes package manager
brew "helm"
# Create Helm chart from Kubernetes yaml
brew "helmify"
# HTTP load generator, ApacheBench (ab) replacement
brew "hey"
# Convert source code to formatted text with syntax highlighting
brew "highlight"
# Improved top (interactive process viewer)
brew "htop"
# Network, Service & Security Observability for Kubernetes using eBPF
brew "hubble"
# Client library for huggingface.co hub
brew "huggingface-cli"
# Configurable static site generator
brew "hugo"
# Command-line benchmarking tool
brew "hyperfine"
# Get events and tasks from the macOS calendar database
brew "ical-buddy"
# H.265/HEVC encoder
brew "x265"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Convert Kubernetes Ingress resources to Kubernetes Gateway API resources
brew "ingress2gateway"
# Utility for IPMI control with kernel driver or LAN interface
brew "ipmitool"
# Interactive computing in Python
brew "ipython"
# Json incremental digger
brew "jid"
# Git-compatible distributed version control system
brew "jj"
# Interactive JSON filter using jq
brew "jnv"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Interactive environments for writing and running code
brew "jupyterlab"
# Handy way to save and run project-specific commands
brew "just"
# Little helper to run CNCF's k3s in Docker
brew "k3d"
# Utility to create k3s clusters on any local or remote VM
brew "k3sup"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Run local Kubernetes cluster in Docker
brew "kind", args: ["HEAD"]
# Tool to move from `docker-compose` to Kubernetes
brew "kompose"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Package manager for kubectl plugins
brew "krew"
# Helps audit your Kubernetes clusters against common security controls
brew "kubeaudit"
# Colorize your kubectl output
brew "kubecolor"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Detects and prevents Kubernetes misconfigurations and violations
brew "kubevious"
# Much more powerful alternative to kubectx and kubens
brew "kubie"
# Template-free customization of Kubernetes YAML manifests
brew "kustomize"
# High quality MPEG Audio Layer III (MP3) encoder
brew "lame"
# Simple terminal UI for git commands
brew "lazygit"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Conversion library
brew "libiconv"
# Shared library for mediainfo
brew "libmediainfo"
# General purpose TCP-IP emulator
brew "libslirp"
# MP3 player for Linux and UNIX
brew "mpg123"
# Audio codec
brew "opus"
# C virtualization API
brew "libvirt"
# Rainbows and unicorns in your console!
brew "lolcat"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit"
# Text-based web browser
brew "lynx"
# Utility for directing compilation
brew "make"
# Mac App Store command-line interface
brew "mas"
# Development kit for the Java programming language
brew "openjdk"
# Java-based project management
brew "maven"
# Unified display of technical and tag data for audio/video
brew "media-info"
# Scalable distributed version control system
brew "mercurial"
# Dependency manager that installs and runs Swift command-line tool packages
brew "mint"
# Cross platform, open source .NET development framework
brew "mono"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"
# MP3 technical info viewer and ID3 1.x tag editor
brew "mp3info"
# Read, create, and modify MP4 files
brew "mp4v2"
# Library for a binary-based efficient data interchange format
brew "msgpack"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# Interactive cheatsheet tool for the command-line
brew "navi"
# Incremental parsing library
brew "tree-sitter"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Utility for managing network connections
brew "netcat"
# RSS/Atom feed reader for text terminals
brew "newsboat"
# HTTP/2 C Library
brew "nghttp2"
# Port scanning utility for large networks
brew "nmap"
# Create, run, and share large language models (LLMs)
brew "ollama"
# Drop-in replacement for Terraform. Infrastructure as Code Tool
brew "opentofu"
# API for decoding and seeking in .opus files
brew "opusfile"
# OCI Registry As Storage
brew "oras"
# Command-line tool to generate, analyze, convert and manipulate colors
brew "pastel"
# Highly capable, feature-rich programming language
brew "perl"
# General-purpose scripting language
brew "php"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# CLI for the Pkl programming language
brew "pkl"
# Paste PNG into files
brew "pngpaste"
# Tool for managing OCI containers and pods
brew "podman"
# Kubernetes cluster resource sanitizer
brew "popeye"
# Object-relational database system
brew "postgresql@14"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Test your LLM app locally
brew "promptfoo"
# Linter for prose
brew "proselint"
# Utilities for manipulating PostScript documents
brew "psutils"
# Monitor data's progress through a pipe
brew "pv"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Python Language Server for the Language Server Protocol
brew "python-lsp-server"
# Python implementation of Markdown
brew "python-markdown"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Compression/decompression library aiming for high speed
brew "snappy"
# Generic machine emulator and virtualizer
brew "qemu"
# Unified tool to manage your Rancher server
brew "rancher-cli"
# Docker and OCI Registry Client in Go and tooling using those libraries
brew "regclient"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Rancher Kubernetes Engine, a Kubernetes installer that works everywhere
brew "rke"
# Extremely fast Python linter, written in Rust
brew "ruff"
# Rust toolchain installer
brew "rustup"
# Low-level access to audio, keyboard, mouse, joystick, and graphics
brew "sdl2"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Autoformat shell script source code
brew "shfmt"
# SMART hard drive monitoring
brew "smartmontools"
# Daemon to provide vmnet.framework support for rootless QEMU
brew "socket_vmnet"
# Editor of encrypted files
brew "sops"
# SOund eXchange: universal sound sample translator
brew "sox"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Cross-shell prompt for astronauts
brew "starship"
# Crypto and x509 Swiss-Army-Knife
brew "step"
# Tail multiple Kubernetes pods & their containers
brew "stern"
# Generate scripting interfaces to C/C++ code
brew "swig"
# Configuration helper for talos clusters
brew "talhelper"
# Tool Command Language
brew "tcl-tk"
# Very fast implementation of tldr in Rust
brew "tealdeer"
# Terminal UI for tshark, inspired by Wireshark
brew "termshark"
# Tool to build, change, and version infrastructure
brew "terraform"
# Terraform Language Server
brew "terraform-ls"
# Official documentation format of the GNU project
brew "texinfo"
# Linter for Terraform files
brew "tflint"
# Code-search similar to ack
brew "the_silver_searcher"
# Terminal multiplexer
brew "tmux"
# Maintained ctags implementation
brew "universal-ctags", args: ["HEAD"]
# URL extractor/launcher
brew "urlview"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Creates fully functional virtual k8s cluster inside host k8s cluster's namespace
brew "vcluster"
# HTTP load testing tool and library
brew "vegeta"
# Generator for LS_COLORS with support for multiple color themes
brew "vivid"
# Pager/text based browser
brew "w3m"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Command-line client for WebSockets
brew "websocat"
# Consistent delivery tool for Kubernetes
brew "werf"
# Internet file retriever
brew "wget"
# Swift native on-device speech recognition with Whisper for Apple Silicon
brew "whisperkit-cli"
# Automatic workarounds for problems in Wine
brew "winetricks"
# Fast CSV toolkit written in Rust
brew "xsv"
# Yet Another Dotfiles Manager
brew "yadm"
# Linter for YAML files
brew "yamllint"
# JavaScript package manager
brew "yarn"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Additional completion definitions for zsh
brew "zsh-completions"
# Scanner for vulnerabilities in container images, file systems, and Git repositories, as well as for configuration issues
brew "aquasecurity/trivy/trivy"
# EC2 Instance Selector is a tool to filter EC2 instance types based on resource criteria
brew "aws/tap/ec2-instance-selector"
# CLI for managing EKS Anywhere Kubernetes clusters
brew "aws/tap/eks-anywhere"
# A CLI for building apps using Cloud Native Buildpacks
brew "buildpacks/tap/pack"
# BOSH CLI
brew "cloudfoundry/tap/bosh-cli"
brew "cloudfoundry/tap/cf-cli"
# CredHub CLI
brew "cloudfoundry/tap/credhub-cli"
# CLI for UAA written in golang
brew "cloudfoundry/tap/uaa-cli"
# The kubectx for operators.
brew "danielfoehrkn/switch/switch"
# CLI for Unicorn Delivery Service
brew "defenseunicorns/tap/uds"
# PAM module for reattaching to the user's GUI (Aqua) session
brew "fabianishere/personal/pam_reattach"
# Turns macOS input fields into real vim buffers
brew "felixkratz/formulae/svim"
# Flux CLI
brew "fluxcd/tap/flux"
# Play, record, convert, and stream audio and video
brew "homebrew-ffmpeg/ffmpeg/ffmpeg", args: ["with-fdk-aac"]
# δyƒƒ /ˈdʏf/ - A diff tool for YAML files, and sometimes JSON
brew "homeport/tap/dyff"
brew "jahvon/tap/flow"
# Smart terminal session manager
brew "joshmedeski/sesh/sesh"
brew "knative/client/kn"
# Simple command-line snippet manager
brew "knqyf263/pet/pet"
brew "martido/brew-graph/brew-graph"
# MinIO Client for object storage and filesystems
brew "minio/stable/mc"
# Package Replicated applications and manage releases, channels, customers and entitlements using a command-line interface.
brew "replicatedhq/replicated/cli"
# Let's see the configs of the Envoy
brew "saltbo/bin/seenvoy"
# CLI for out-of-band management of Kubernetes nodes created by Talos
brew "siderolabs/tap/talosctl"
# Rename an Xcode project throughout a directory
brew "stewartlynch/tap/xprename"
# Regal is a linter for Rego, with the goal of making your Rego magnificent!
brew "styrainc/packages/regal"
# AI-generated memory files manager for Git
brew "trknhr/tap/ai-docs"
# Automatic tiling window manager similar to xmonad
cask "amethyst", args: { appdir: "~/Applications/Ops/Administration/Window Management" }
# Distribution of the Python and R programming languages for scientific computing
cask "anaconda", args: { appdir: "~/Applications" }
# Quick Look Plugin for AVIF images
cask "avifquicklook"
cask "font-fira-mono-nerd-font"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty", args: { appdir: "~/Applications/Comm/Terminal" }
# Open-source keystroke visualiser
cask "keycastr", args: { appdir: "~/Applications/Ops/Administration" }
# Window manager
cask "loop", args: { appdir: "~/Applications/Ops/Administration/Window Management" }
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Replacement for Docker Desktop
cask "orbstack", args: { appdir: "~/Applications/Ops/Engineering" }
# Run macOS virtual machines locally and build images for use with Orka
cask "orka-desktop", args: { appdir: "~/Applications/Ops/Engineering" }
# Quick Look generator for Markdown files
cask "qlmarkdown"
# Thumbnails, static previews, cover art and metadata for video files
cask "qlvideo", args: { appdir: "~/Applications/Comm/Visual" }
# Productivity application
cask "quicksilver", args: { appdir: "~/Applications/Ops/Administration" }
# Control your tools with a few keystrokes
cask "raycast", args: { appdir: "~/Applications/Ops/Administration" }
# Store SSH keys in the Secure Enclave
cask "secretive"
# Comic viewer/reader
cask "simple-comic", args: { appdir: "~/Applications/Comm/Visual" }
# Launcher & command palette
cask "sol", args: { appdir: "~/Applications/Ops/Administration" }
# Virtual machines UI using QEMU
cask "utm", args: { appdir: "~/Applications/Holodeck" }
# Multiplayer code editor
cask "zed", args: { appdir: "~/Applications/Comm/Written" }
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Obsidian Web Clipper", id: 6720708363
mas "Okta Verify", id: 490179405
mas "Pages", id: 409201541
mas "Peek", id: 1554235898
mas "Slack", id: 803453959
