tap "aquasecurity/trivy"
tap "aws/tap"
tap "buildpacks/tap"
tap "cloudfoundry/tap"
tap "derailed/k9s"
tap "fabianishere/personal"
tap "federico-terzi/espanso"
tap "homebrew-ffmpeg/ffmpeg"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homeport/tap"
tap "k14s/tap"
tap "knative/client"
tap "martido/brew-graph"
tap "mczachurski/wallpapper"
tap "nativeos/i386-elf-toolchain"
tap "saltbo/bin"
tap "solo-io/tap"
tap "stevenacoffman/keyfob"
tap "sttz/tap", "https://github.com/sttz/homebrew-tap.git"
tap "styrainc/packages"
tap "ubuntu/microk8s"
tap "universal-ctags/universal-ctags"
tap "watsonbox/cmu-sphinx"
tap "zdcthomas/tools"
# CLI for Amazon ECS to manage clusters and tasks for development
brew "amazon-ecs-cli"
# Implements a XML/HTML/XHTML Markup safe string for Python
brew "python-markupsafe"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Python code formatter
brew "black"
# Linter for YAML files
brew "yamllint"
# Checks ansible playbooks for practices and behaviour
brew "ansible-lint"
# Strip or convert ANSI codes into HTML, (La)Tex, RTF, or BBCode
brew "ansifilter"
# Color management engine supporting ICC profiles
brew "little-cms2"
# Image format providing lossless and lossy compression for web images
brew "webp"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# GitOps Continuous Delivery for Kubernetes
brew "argocd"
# Collection of portable C++ source libraries
brew "boost"
# Source-code syntax highlighter
brew "source-highlight"
# Formatter/translator for text files to numerous formats
brew "asciidoc"
# Text processor and publishing toolchain for AsciiDoc
brew "asciidoctor"
# Record and share terminal sessions
brew "asciinema"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Use AWS IAM credentials to authenticate to Kubernetes
brew "aws-iam-authenticator"
# Securely manage AWS API credentials using AWS SSO
brew "aws-sso-cli"
# Securely store and access AWS credentials in development environments
brew "aws-vault"
# Text processing system for reStructuredText
brew "docutils"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Official Amazon AWS command-line interface
brew "awscli"
# Azure Storage data transfer utility
brew "azcopy"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Programmable completion for Bash 4.2+
brew "bash-completion@2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# High performance key/value database
brew "berkeley-db", link: true
# Perl compatible regular expressions library with a new API
brew "pcre2"
# Core application library for C
brew "glib"
# Vector graphics library with cross-device output support
brew "cairo"
# CD/DVD/Blu-ray premastering and recording software
brew "cdrtools"
# Display user-friendly message boxes from shell scripts
brew "dialog"
# Tool to obtain certs from Let's Encrypt and autoenable HTTPS
brew "certbot"
# CLI to install, manage & troubleshoot Kubernetes clusters running Cilium
brew "cilium-cli"
# Cross-platform make
brew "cmake"
# Command-line tool to manage cert-manager
brew "cmctl"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# General purpose TCP-IP emulator
brew "libslirp"
# C library SSHv1/SSHv2 client and server protocols
brew "libssh"
# Compression/decompression library aiming for high speed
brew "snappy"
# Generic machine emulator and virtualizer
brew "qemu"
# Linux virtual machines
brew "lima"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima", args: ["HEAD"]
# Tool for service discovery, monitoring and configuration
brew "consul"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Configurable talking characters in ASCII art
brew "cowsay"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Tools to manipulate dates with a focus on financial data
brew "dateutils"
# Library access to GnuPG
brew "gpgme"
# Library for JPEG-2000 image manipulation
brew "openjpeg"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Visually compare two PDF files
brew "diff-pdf"
# Load/unload environment variables based on $PWD
brew "direnv"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Create Docker hosts locally and on cloud providers
brew "docker-machine"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# More intuitive version of du in rust
brew "dust"
# Simple command-line tool for creating clusters on Amazon EKS
brew "eksctl"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line encoder frontend for libfdk-aac
brew "fdk-aac-encoder"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Collection of GNU find, xargs, and locate
brew "findutils"
# I/O benchmark and stress test
brew "fio"
# Lint your Python code for style and logical errors
brew "flake8"
# HTTP and gRPC load testing and visualization tool and server
brew "fortio"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Generic library support script
brew "libtool"
# Libraries to talk to Microsoft SQL Server and Sybase databases
brew "freetds"
# GNU awk utility
brew "gawk"
# Easily access your Google Calendar(s) from a command-line
brew "gcalcli"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# GIF image/animation creator/editor
brew "gifsicle"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Extensions to follow Vincent Driessen's branching model
brew "git-flow"
# Platform built on V8 to build network applications
brew "node"
# Interactive command-line tool for using emoji in commit messages
brew "gitmoji"
# Envoy-Powered API Gateway
brew "glooctl"
# Command-line option parsing utility
brew "gnu-getopt"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Library for manipulating JPEG-2000 images
brew "jasper"
# Image manipulation
brew "netpbm"
# GNU triangulated surface library
brew "gts"
# OpenType text shaping engine
brew "harfbuzz"
# Framework for layout and rendering of i18n text
brew "pango"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GNU grep, egrep and fgrep
brew "grep"
# Python implementation of Markdown
brew "python-markdown"
# GitHub Markdown previewer
brew "grip"
# Utilities for manipulating PostScript documents
brew "psutils"
# GNU troff text-formatting system
brew "groff"
# Make JSON greppable
brew "gron"
# Like cURL, but for gRPC
brew "grpcurl"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# Tool for glamorous shell scripts
brew "gum"
# Smarter Dockerfile linter to validate best practices
brew "hadolint"
# Kubernetes package manager
brew "helm"
# HTTP load generator, ApacheBench (ab) replacement
brew "hey"
# Convert source code to formatted text with syntax highlighting
brew "highlight"
# Improved top (interactive process viewer)
brew "htop"
# Network, Service & Security Observability for Kubernetes using eBPF
brew "hubble"
# Configurable static site generator
brew "hugo"
# Get events and tasks from the macOS calendar database
brew "ical-buddy"
# Utility for IPMI control with kernel driver or LAN interface
brew "ipmitool"
# Interactive computing in Python
brew "ipython"
# Json incremental digger
brew "jid"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Implementation of JSON Schema for Python
brew "jsonschema"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Extremely fast Python linter, written in Rust
brew "ruff"
# Python Language Server for the Language Server Protocol
brew "python-lsp-server"
# Interactive environments for writing and running code
brew "jupyterlab"
# Little helper to run CNCF's k3s in Docker
brew "k3d"
# Utility to create k3s clusters on any local or remote VM
brew "k3sup"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Run local Kubernetes cluster in Docker
brew "kind", args: ["HEAD"]
# Tool to move from `docker-compose` to Kubernetes
brew "kompose"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Package manager for kubectl plugins
brew "krew"
# Helps audit your Kubernetes clusters against common security controls
brew "kubeaudit"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Manage multiple kubernetes cluster at the same time
brew "kubesess"
# Much more powerful alternative to kubectx and kubens
brew "kubie"
# Template-free customization of Kubernetes YAML manifests
brew "kustomize"
# Simple terminal UI for git commands
brew "lazygit"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Conversion library
brew "libiconv"
# C virtualization API
brew "libvirt"
# Rainbows and unicorns in your console!
brew "lolcat"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Text-based web browser
brew "lynx"
# Utility for directing compilation
brew "make"
# Mac App Store command-line interface
brew "mas"
# Development kit for the Java programming language
brew "openjdk"
# Java-based project management
brew "maven"
# Unified display of technical and tag data for audio/video
brew "media-info"
# Scalable distributed version control system
brew "mercurial"
# Cross platform, open source .NET development framework
brew "mono"
# MP3 technical info viewer and ID3 1.x tag editor
brew "mp3info"
# Read, create, and modify MP4 files
brew "mp4v2"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Utility for managing network connections
brew "netcat"
# RSS/Atom feed reader for text terminals
brew "newsboat"
# HTTP/2 C Library
brew "nghttp2"
# Port scanning utility for large networks
brew "nmap"
# Kubernetes introspection tool for developers
brew "octant"
# API for decoding and seeking in .opus files
brew "opusfile"
# Tool for creating identical machine images for multiple platforms
brew "packer"
# Command-line tool to generate, analyze, convert and manipulate colors
brew "pastel"
# Highly capable, feature-rich programming language
brew "perl"
# General-purpose scripting language
brew "php"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Tool for managing OCI containers and pods
brew "podman"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Linter for prose
brew "proselint"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Tool Command Language
brew "tcl-tk"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Unified tool to manage your Rancher server
brew "rancher-cli"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Rancher Kubernetes Engine, a Kubernetes installer that works everywhere
brew "rke"
# Rust toolchain installer
brew "rustup-init"
# Low-level access to audio, keyboard, mouse, joystick, and graphics
brew "sdl2"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Autoformat shell script source code
brew "shfmt"
# SMART hard drive monitoring
brew "smartmontools"
# Daemon to provide vmnet.framework support for rootless QEMU
brew "socket_vmnet"
# Editor of encrypted files
brew "sops"
# SOund eXchange: universal sound sample translator
brew "sox"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Cross-shell prompt for astronauts
brew "starship"
# Crypto and x509 Swiss-Army-Knife
brew "step"
# Tail multiple Kubernetes pods & their containers
brew "stern"
# Generate scripting interfaces to C/C++ code
brew "swig"
# Terraform Language Server
brew "terraform-ls"
# Official documentation format of the GNU project
brew "texinfo", link: false
# Linter for Terraform files
brew "tflint"
# Code-search similar to ack
brew "the_silver_searcher"
# Programmatically correct mistyped console commands
brew "thefuck"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Maintained ctags implementation
brew "universal-ctags", args: ["HEAD"]
# URL extractor/launcher
brew "urlview"
# Bash completion for Vagrant
brew "vagrant-completion"
# Secures, stores, and tightly controls access to secrets
brew "vault"
# Creates fully functional virtual k8s cluster inside host k8s cluster's namespace
brew "vcluster"
# HTTP load testing tool and library
brew "vegeta"
# Vi 'workalike' with many additional features
brew "vim"
# Generator for LS_COLORS with support for multiple color themes
brew "vivid"
# Pager/text based browser
brew "w3m"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Command-line client for WebSockets
brew "websocat"
# Internet file retriever
brew "wget"
# Automatic workarounds for problems in Wine
brew "winetricks"
# Fast CSV toolkit written in Rust
brew "xsv"
# Yet Another Dotfiles Manager
brew "yadm"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Additional completion definitions for zsh
brew "zsh-completions"
# Scanner for vulnerabilities in container images, file systems, and Git repositories, as well as for configuration issues
brew "aquasecurity/trivy/trivy"
# EC2 Instance Selector is a tool to filter EC2 instance types based on resource criteria
brew "aws/tap/ec2-instance-selector"
# CLI for managing EKS Anywhere Kubernetes clusters
brew "aws/tap/eks-anywhere"
# A CLI for building apps using Cloud Native Buildpacks
brew "buildpacks/tap/pack"
# BOSH CLI
brew "cloudfoundry/tap/bosh-cli"
brew "cloudfoundry/tap/cf-cli"
# CredHub CLI
brew "cloudfoundry/tap/credhub-cli"
# CLI for UAA written in golang
brew "cloudfoundry/tap/uaa-cli"
# PAM module for reattaching to the user's GUI (Aqua) session
brew "fabianishere/personal/pam_reattach"
# Play, record, convert, and stream audio and video
brew "homebrew-ffmpeg/ffmpeg/ffmpeg", args: ["with-fdk-aac"]
# δyƒƒ /ˈdʏf/ - A diff tool for YAML files, and sometimes JSON
brew "homeport/tap/dyff"
brew "knative/client/kn"
brew "martido/brew-graph/brew-graph"
# GNU GRUB 2 targetting i386-elf
brew "nativeos/i386-elf-toolchain/i386-elf-grub"
# Let's see the configs of the Envoy
brew "saltbo/bin/seenvoy"
# keyfob - a two-factor authentication agent suitable for AWS and Github
brew "stevenacoffman/keyfob/keyfob"
# Regal is a linter for Rego, with the goal of making your Rego magnificent!
brew "styrainc/packages/regal"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "google-cloud-sdk"
# Tools to protect your emails and files
cask "gpg-suite", args: { appdir: "~/Applications/Ops/Clandestine" }
# Open Source Multimedia Framework
cask "gstreamer-runtime"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# ZFS driver and utilities
cask "openzfs"
# Command-line shell and scripting language
cask "powershell"
# Quick Look generator for Markdown files
cask "qlmarkdown"
# Control your tools with a few keystrokes
cask "raycast"
# Development environment
cask "vagrant", args: { appdir: "~/Applications/Ops/Engineering" }
# Compatibility layer to run Windows applications
cask "wine-stable"
# Network protocol analyzer
cask "wireshark-chmodbpf"
mas "Actions", id: 1586435171
mas "Actions for Obsidian", id: 1659667937
mas "Animoog Z", id: 1586841361
mas "Audiobook Builder", id: 1437681957
mas "GarageBand", id: 682658836
mas "Health Auto Export", id: 1115567069
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Mastonaut", id: 1450757574
mas "Microsoft OneNote", id: 784801555
mas "Numbers", id: 409203825
mas "Omnivore", id: 1564031042
mas "Pages", id: 409201541
mas "Paprika Recipe Manager 3", id: 1303222628
mas "Peek", id: 1554235898
mas "Prime Video", id: 545519333
mas "Save to Reader", id: 1640236961
mas "Screens 5", id: 1663047912
mas "Silicio", id: 933627574
mas "Steam Link", id: 1246969117
mas "TestFlight", id: 899247664
mas "Twitter", id: 1482454543
mas "Vimari", id: 1480933944
mas "Xcode", id: 497799835
