tap "aquasecurity/trivy"
tap "aws/tap"
tap "buildpacks/tap"
tap "cloudfoundry/tap"
tap "derailed/k9s"
tap "fabianishere/personal"
tap "federico-terzi/espanso"
tap "homebrew-ffmpeg/ffmpeg"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homeport/tap"
tap "k14s/tap"
tap "knative/client"
tap "martido/brew-graph"
tap "mczachurski/wallpapper"
tap "nativeos/i386-elf-toolchain"
tap "saltbo/bin"
tap "stevenacoffman/keyfob"
tap "sttz/tap", "https://github.com/sttz/homebrew-tap.git"
tap "ubuntu/microk8s"
tap "universal-ctags/universal-ctags"
tap "watsonbox/cmu-sphinx"
tap "zdcthomas/tools"
# CLI for Amazon ECS to manage clusters and tasks for development
brew "amazon-ecs-cli"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10", link: false
# Automate deployment, configuration, and upgrading
brew "ansible"
# Checks ansible playbooks for practices and behaviour
brew "ansible-lint"
# Strip or convert ANSI codes into HTML, (La)Tex, RTF, or BBCode
brew "ansifilter"
# Companion library to apr, the Apache Portable Runtime library
brew "apr-util"
# GitOps Continuous Delivery for Kubernetes
brew "argocd"
# Collection of portable C++ source libraries
brew "boost"
# Source-code syntax highlighter
brew "source-highlight"
# Formatter/translator for text files to numerous formats
brew "asciidoc"
# Text processor and publishing toolchain for AsciiDoc
brew "asciidoctor"
# Record and share terminal sessions
brew "asciinema"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Securely store and access AWS credentials in development environments
brew "aws-vault"
# Official Amazon AWS command-line interface
brew "awscli"
# Azure Storage data transfer utility
brew "azcopy"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 4.2+
brew "bash-completion@2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# High performance key/value database
brew "berkeley-db", link: true
# Core application library for C
brew "glib"
# Vector graphics library with cross-device output support
brew "cairo"
# Display user-friendly message boxes from shell scripts
brew "dialog"
# Tool to obtain certs from Let's Encrypt and autoenable HTTPS
brew "certbot"
# CLI to install, manage & troubleshoot Kubernetes clusters running Cilium
brew "cilium-cli"
# Cross-platform make
brew "cmake"
# Generic library support script
brew "libtool"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# General purpose TCP-IP emulator
brew "libslirp"
# Compression/decompression library aiming for high speed
brew "snappy"
# Emulator for x86 and PowerPC
brew "qemu"
# Linux virtual machines
brew "lima"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima", args: ["HEAD"]
# Tool for service discovery, monitoring and configuration
brew "consul"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Configurable talking characters in ASCII art
brew "cowsay"
# Open source suite of directory software
brew "openldap"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Tools to manipulate dates with a focus on financial data
brew "dateutils"
# Load/unload environment variables based on $PWD
brew "direnv"
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# Create Docker hosts locally and on cloud providers
brew "docker-machine"
# Text processing system for reStructuredText
brew "docutils"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# More intuitive version of du in rust
brew "dust"
# Simple command-line tool for creating clusters on Amazon EKS
brew "eksctl"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Banner-like program prints strings as ASCII art
brew "figlet"
# I/O benchmark and stress test
brew "fio"
# Lint your Python code for style and logical errors
brew "flake8"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Libraries to talk to Microsoft SQL Server and Sybase databases
brew "freetds"
# Easily access your Google Calendar(s) from a command-line
brew "gcalcli"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# GitHub command-line tool
brew "gh"
# GIF image/animation creator/editor
brew "gifsicle"
# Perl compatible regular expressions library with a new API
brew "pcre2"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Extensions to follow Vincent Driessen's branching model
brew "git-flow"
# Platform built on V8 to build network applications
brew "node"
# Interactive command-line tool for using emoji in commit messages
brew "gitmoji"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Simplified Go project management, dependency management, and vendoring
brew "glide"
# Envoy-Powered API Gateway
brew "glooctl"
# Command-line option parsing utility
brew "gnu-getopt"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Fast linters runner for Go
brew "golangci-lint"
# OpenType text shaping engine
brew "harfbuzz"
# Framework for layout and rendering of i18n text
brew "pango"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GNU grep, egrep and fgrep
brew "grep"
# GitHub Markdown previewer
brew "grip"
# Make JSON greppable
brew "gron"
# Like cURL, but for gRPC
brew "grpcurl"
# Smarter Dockerfile linter to validate best practices
brew "hadolint"
# HTTP load generator, ApacheBench (ab) replacement
brew "hey"
# Convert source code to formatted text with syntax highlighting
brew "highlight"
# Improved top (interactive process viewer)
brew "htop"
# Network, Service & Security Observability for Kubernetes using eBPF
brew "hubble"
# Get events and tasks from the macOS calendar database
brew "ical-buddy"
# Utility for IPMI control with kernel driver or LAN interface
brew "ipmitool"
# Interactive computing in Python
brew "ipython"
# Json incremental digger
brew "jid"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Interactive environments for writing and running code
brew "jupyterlab"
# Little helper to run CNCF's k3s in Docker
brew "k3d"
# Utility to create k3s clusters on any local or remote VM
brew "k3sup"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Run local Kubernetes cluster in Docker
brew "kind", args: ["HEAD"]
# Tool to move from `docker-compose` to Kubernetes
brew "kompose"
# Network authentication protocol
brew "krb5"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Package manager for kubectl plugins
brew "krew"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Consume Services in k8s using the OSB API
brew "kubernetes-service-catalog-client"
# Much more powerful alternative to kubectx and kubens
brew "kubie"
# Template-free customization of Kubernetes YAML manifests
brew "kustomize"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Postgres C API library
brew "libpq"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Library implementing a curses-based widget set for terminals
brew "libstfl"
# Rainbows and unicorns in your console!
brew "lolcat"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Utility for directing compilation
brew "make"
# Mac App Store command-line interface
brew "mas"
# Development kit for the Java programming language
brew "openjdk"
# Java-based project management
brew "maven"
# Unified display of technical and tag data for audio/video
brew "media-info"
# Scalable distributed version control system
brew "mercurial"
# Command-line interface (CLI) for mermaid
brew "mermaid-cli"
# Cross platform, open source .NET development framework
brew "mono"
# MP3 technical info viewer and ID3 1.x tag editor
brew "mp3info"
# Read, create, and modify MP4 files
brew "mp4v2"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Utility for managing network connections
brew "netcat"
# RSS/Atom feed reader for text terminals
brew "newsboat"
# HTTP/2 C Library
brew "nghttp2"
# Port scanning utility for large networks
brew "nmap"
# Kubernetes introspection tool for developers
brew "octant"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Tool for creating identical machine images for multiple platforms
brew "packer"
# Command-line tool to generate, analyze, convert and manipulate colors
brew "pastel"
# General-purpose scripting language
brew "php"
# Pinentry for GPG on Mac
brew "pinentry-mac", link: false
# Tool for managing OCI containers and pods
brew "podman"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Linter for prose
brew "proselint"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Tool Command Language
brew "tcl-tk"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8", link: false
# Unified tool to manage your Rancher server
brew "rancher-cli"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Rancher Kubernetes Engine, a Kubernetes installer that works everywhere
brew "rke"
# Safe, concurrent, practical language
brew "rust"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Autoformat shell script source code
brew "shfmt"
# SMART hard drive monitoring
brew "smartmontools"
# Editor of encrypted files
brew "sops"
# SOund eXchange: universal sound sample translator
brew "sox"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Cross-shell prompt for astronauts
brew "starship"
# Crypto and x509 Swiss-Army-Knife
brew "step"
# Tail multiple Kubernetes pods & their containers
brew "stern"
# Generate scripting interfaces to C/C++ code
brew "swig"
# Tool to build, change, and version infrastructure
brew "terraform", link: false
# Terraform Language Server
brew "terraform-ls"
# Official documentation format of the GNU project
brew "texinfo"
# Terraform version manager inspired by rbenv
brew "tfenv"
# Linter for Terraform files
brew "tflint"
# Code-search similar to ack
brew "the_silver_searcher"
# Programmatically correct mistyped console commands
brew "thefuck"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# URL extractor/launcher
brew "urlview"
# Bash completion for Vagrant
brew "vagrant-completion"
# Secures, stores, and tightly controls access to secrets
brew "vault"
# Creates fully functional virtual k8s cluster inside host k8s cluster's namespace
brew "vcluster"
# HTTP load testing tool and library
brew "vegeta"
# Vi 'workalike' with many additional features
brew "vim"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Fast CSV toolkit written in Rust
brew "xsv"
# Yet Another Dotfiles Manager
brew "yadm"
# Linter for YAML files
brew "yamllint"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Process YAML documents from the CLI
brew "yq"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Additional completion definitions for zsh
brew "zsh-completions"
# Scanner for vulnerabilities in container images, file systems, and Git repositories, as well as for configuration issues
brew "aquasecurity/trivy/trivy"
# EC2 Instance Selector is a tool to filter EC2 instance types based on resource criteria
brew "aws/tap/ec2-instance-selector"
# CLI for managing EKS Anywhere Kubernetes clusters
brew "aws/tap/eks-anywhere"
# A CLI for building apps using Cloud Native Buildpacks
brew "buildpacks/tap/pack"
# BOSH CLI
brew "cloudfoundry/tap/bosh-cli"
brew "cloudfoundry/tap/cf-cli"
# CredHub CLI
brew "cloudfoundry/tap/credhub-cli"
# CLI for UAA written in golang
brew "cloudfoundry/tap/uaa-cli"
# PAM module for reattaching to the user's GUI (Aqua) session
brew "fabianishere/personal/pam_reattach"
# Cross-platform Text Expander written in Rust
brew "federico-terzi/espanso/espanso"
# Play, record, convert, and stream audio and video
brew "homebrew-ffmpeg/ffmpeg/ffmpeg", args: ["with-fdk-aac"]
# δyƒƒ /ˈdʏf/ - A diff tool for YAML files, and sometimes JSON
brew "homeport/tap/dyff"
# Imgpkg
brew "k14s/tap/imgpkg"
# Kapp
brew "k14s/tap/kapp"
# kbld helps working with container images used in Kubernetes configuration files
brew "k14s/tap/kbld"
# Kubernetes Workstation Tools
brew "k14s/tap/kwt"
# Declaratively state what should be in a directory
brew "k14s/tap/vendir"
# YAML Templating Tool
brew "k14s/tap/ytt"
brew "knative/client/kn"
brew "martido/brew-graph/brew-graph"
# GNU GRUB 2 targetting i386-elf
brew "nativeos/i386-elf-toolchain/i386-elf-grub"
# Let's see the configs of the Envoy
brew "saltbo/bin/seenvoy"
# keyfob - a two-factor authentication agent suitable for AWS and Github
brew "stevenacoffman/keyfob/keyfob"
# expresso is a command line interface to control the ExpressVPN app
brew "sttz/tap/expresso"
# Small, fast, single-package Kubernetes for developers, IoT and edge
brew "ubuntu/microk8s/microk8s"
# Maintained ctags implementation
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
# Creates and handles tmux workspaces
brew "zdcthomas/tools/dmux"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "google-cloud-sdk"
# Tools to protect your emails and files
cask "gpg-suite", args: { appdir: "~/Applications/Ops/Clandestine" }
# Orchestrates virtual Ubuntu instances
cask "multipass"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Command-line shell and scripting language
cask "powershell"
# QuickLook generator for Markdown files
cask "qlmarkdown"
# Development environment
cask "vagrant", args: { appdir: "~/Applications/Ops/Engineering" }
# Virtualizer for x86 hardware
cask "virtualbox", args: { appdir: "~/Applications/Ops/Engineering" }
# Extend the functionality of VirtualBox
cask "virtualbox-extension-pack"
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Microsoft OneNote", id: 784801555
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Paprika Recipe Manager 3", id: 1303222628
mas "Peek", id: 1554235898
mas "Silicio", id: 933627574
mas "Soulver 3", id: 1508732804
mas "Twitter", id: 1482454543
mas "Vimari", id: 1480933944
mas "Xcode", id: 497799835
